""" การรับ อินพุต/เอาต์พุต และการคอมเมนต์"""

# การับค่าต่างๆ ใช้คำสั่ง input()
variable = input("arg= ")  # arg คือคำที่จะแสดงตอนรับค่า
# variable คือ ตัวแปรมใช้ในการเก็บข้อมูลที่รับมาจาก คำสั่ง input

# คำสั่งในการแสดงผล ใช้คำสั่ง   print()
print(variable)
"""
คำสั่งจะแสดงตัวแปรของ variable ที่เราใส่ค่าเข้าไป 
"""

"""หากต้องการแสดงตัวอักษระ"""
print("Hello")

# หากต้องการแสดงผลตัวเลข
print(123)

# จำนวนทศนิยม
print(1.323)

# ค่า จริงหรือ เท็จ
print(True)
print(False)

# ใช้ คอมเมนต์บรรดทัดเดียว
"""
ใช้หลายบรรดทัด
"""