from typing import Tuple
#ชนิดของมูลไพธอน
'''Number ประกอบด้วย จำนวนเต็ม ทศนิยม เชิงช้อน'''
#จำนวนเต็ม Integer หรือ int มีขนาด 8ไบต์ (64บิต)
'''เลชฐานต่างๆ ต้องเริ่มด้วย0'''
#เลขฐาน 2 เริ่มด้วย 0b

0b10010 #มีค่า18

#เลขฐาน 8 0O
0O456 #มีค่า302

#เบขฐาน 16 0X
0x12FA #มีค่า4858

#ฐานสิบ
10 #มีค่า10
'''การแปลงจากฐาน10 ไปเลขฐานต่างๆ'''
num=150
print("ฐาน2 = " + bin(num))  #ฐาน2
print("ฐาน8 = " + oct(num))  #ฐาน8
print("ฐาน16 = " + hex(num))  #ฐาน16

#จำนวนทศนิยม Floating-point numbers หรือ float
'''สามารถกำหนดค่าทศนิยมด้วยเอ็กซ์โพเนนเียลที่มีค่าติดลบได้'''
0.55 -5.94 
print(2.45e-2) #=0.0245

#จำนวนเชิงซ้อน (Complex number)
'''คือจำนวนที่ประกอบ จำนวนจริง(Real number) และจำนวนจินตภาพ(lmaginary number)นิยมใช้ในด้านวิทยาศาสตร์และวิศวกรรม'''
num1=2+8j
#จำนวนจริง 
print("จำนวนจริง" , num1.real)
#จำนวนจินตภาพ
print("จำนวนจินตภาพ" , num1.imag)

#ข้อมูล ตรรกะ 
'''ค่าจริงหรือเท็จ ใช้เปรียบเทียบ True หรือ False'''
i=5>2
print(i)

#Srting
'''ชนิดข้อมูลแบบอักษร หรืออักขระต่างๆ '''
pub='Simplify'
print(pub)
name='My name is "Sanya"'
print(name)

#list
list=[10,2.25,"Hello Python"]
#ใส่ได้ทั้ง int float str
'''เป็นชนิดข้อมูลในลักษณะของรายการเรียงต่อกัน มีการแบ่งคั่นระหว่างรายการด้วยเครื่องหมาย , ข้อมูลทั้งหมาย []และสามารถแก้ไขได้'''
print(list)

#Tuple
tuple=(5,2.08,'Hello Python',2+8j)
'''มีส่วนประกอบคล้ายๆ list แต่ไม่สามารถ เพิ่ม ลด หรือแก้ไขข้อมูลที่ใส่ไปได้ แล้วอยู่ในเครื่่งหมาย ()'''
print(tuple)

#Set
set={1,2,3,4,4,'a','c','c'}
'''เป็นชุดข้อมูลที่รายการไม่ซ้ำกันและไม่จัดลำดับ อยู่ในใต้เครื่องหมาย{}และสนับสนุนตัวดำเนินการทางวิทยาศาสตร์ จะกล่าวในบทฟังชัน'''
print(set)

#Dictionary 
'''เป็นข้อมูลในลักษณะของรายการ ประกอบด้วยKey/Vaue โดยแต่ละคียในดิกชันนารี ต้องไม่ซ้ำกันอยู่ในเครื่องใต้เครื่องหมาย {} สามารถแก้ เพิ่ม ลด ได้ สามารถค้นหาได้ง่าย จากการหาจากคีย์ '''
Dictionary={'a':"apple",2:"two",3:2.44}
print(Dictionary)

#การอ่านข้อมูลแบบเรียงลำดับและจับคู่
'''สำหรับชนิดข้อมูลแบบ list Tuple str สามารถอ่านได้จากindex โดยใส่เครื่องหมาย[]อยู่หลังตัวแปรง ตัวเลขindexต้องไม่เกิน จำนวน list โดยเริ่มนับจาก 0 เป็นตัวแรกหรือจะอ่านจากindex ตัวอยู่ให้เริ่มนับจาก -1'''
print(pub[5]) #ตัวอักษรตัวที่ 4 ของตัวแปรง pub
print(list[0]) #ตัวข้อมูลที่ 1 ของชุดข้อมูลของlist 

'''ส่วนของDictionary จะใช้คีย์ในการค้นหา'''
print(Dictionary[2]) #คีย์ที่ 2  ของชุดข้อมูลของDictionary

#เรียกดูช่วงของช้อมูลใน String list Tuple
'''รูปแบบ ชื่อตัวแปรง[เริ่ม : จบ] โดยเริ่มนับจาก 0 ''' 
print(pub[2:]) #เริ่มจากindexที่ 2 จนถึงตัวสุดท้าย
print(pub[:2]) #เริ่มจากindexที่ 0 ไปถึง 2
print(pub[1:4]) #เริ่มจากindexที่ 2 จนถึงตัวสุดท้าย

'''list หรือ Tuple'''
print(list[0:2]) #เริ่มจากindexที่ 0 ไปถึง 2
print(tuple[1:3])#เริ่มจากindexที่ 1 ไปถึง 3

#การเพิ่ม ลด แก้ไข ข้อมูลใน list Dictionary
#การเพิ่ม 
list=list+["sanya"]
list.append(1)
print(list)

#การแก้ไข
list[3]="Tangsook"
print(list)

#การลบ
del list[3:]
print(list)

#การแก้ไขใน Dictionary
Dictionary["a"]="Champ"
print(Dictionary)

#การลบ Dictionary
del Dictionary["a"]
print(Dictionary)

#การใช้ del นั้น ตัวแปรหรือข้อมูลที่ลบไปนั้นจะหายไปแล้ว ไม่สามารถเรียกคืนได้ นอกจากจะใส่ข้อมูลไปใหม่

#การตรวจสอบชนิดข้อมูล
print(type(num))
print(type(name))
print(type(num1))
print(type(list))
print(type(Tuple))
print(type(set))
print(type(Dictionary))

#การแปลงชนิดข้อมูล
print(float(5)) #แปลงเป็นfloat
print(int(10.60)) #แปลงเป็น int
print(str(5)) #แปลงเป็น str
a=5234
print(str(a)) #แปลงจาก int 5234 เป็น str "5234"

#แปลง list TO Set
'''set([1,2,3,4])'''
#การแปลง Set TO Tuple
'''tuple({5,6,7,8})'''
#แปลง String To list
'''list("hello")'''
#แปลง list to Dictioanry ในลักษณ์จับคุ่
dict([[1,2],[3,4]])