#การเลือกทำโดยกำหนดเงื่อนไข (Decision Making) 
'''การเลือกทำ (Decision Making) เป็นการเขียนโปรแกรมโดยมีเงื่อนไขที่กำหนดเมื่อ จริง หรือ เท็จให้เลือกทำงานกับโค้คคำสั่งหรือสเตตเมนต์(Statement) 
ในภาษาไซธอนประกอบด้วย if, if...eles,if.elif (ในไพธอนไม่ติดตั้งไม่มีคำสั่ง Switch เหมือนกับภาษาอื่น ๆ )'''
#การเลือกทำด้วย if
'''เป็นคำสั่งกำหนดเงื่อนไขเพื่อควบคุมให้โปรแกรมทำงานเฉพาะคำสั่งที่ต้องการเมื่อเงื่อนไขเป็นจริงเท่านั้น ซึ่งเป็นการเลือกทำที่มีทางเลือกเดียว'''

#การเลือกทำด้วยเงื่อนไข if...eles
'''เป็นการกำหนดเงื่อนไขให้โปรแกรมเลือกทำ 2 กรณี คือ เป็นจริง หรือ เท็จ มีรูปแบบดังนี้'''
x = 5 
if x % 2 == 0 : #ถ้า x % 2 เท่ากับ 0 จะแสดงข้อความ "X is even number"
    print("X is even number")
else :  #ถ้า x % 2 ไม่เท่ากับ 0 จะแสดงข้อความ "X is odd number"
    print("X is odd number")

#การเลือกทำด้วยเงื่อนไข if...elif หรือ if...elif...else 
'''เป็นการเลืกทำหลายทางเลือก โดยจะไล่ตรวจสอบเงื่อนไขลงมาจากบนลงมาล่าง โดยจะทำเมื่อเงื่อนไขตรงกับบล็อกใดบล็อกนึง
จะทำหน้าที่เหมือนคำสั่ง Switch ไพธอนเลยไม่จำเป็นต้องมีคำสั่งนี้'''
score=int(input("Please Enter Score = ")) #ในคะแนนลงไป และทำการแปรงเป็น int
if score >= 80 and score <= 100 : #ถ้า ตัวแปร score มากกว่า 80 และ น้อยกว่า 100
    print("Score =",score,"Grade is A") # จะได้เกรด A
elif score >= 70 and score <= 79 : #ถ้า ตัวแปร score มากกว่า 70 และ น้อยกว่า 79
    print("Score =",score,"Grade is B") # จะได้เกรด B
elif score >= 60 and score <= 69 : #ถ้า ตัวแปร score มากกว่า 60 และ น้อยกว่า 69
    print("Score =",score,"Grade is C") # จะได้เกรด C
elif score >= 50 and score <= 59 : #ถ้า ตัวแปร score มากกว่า 50 และ น้อยกว่า 59
    print("Score =",score,"Grade is D") # จะได้เกรด D
else : #ถ้า ตัวแปร score ไม่ตรงกับเงื่อนไขใดเลย
    print("Score =",score,"Grade is F") # จะได้เกรด F

#การกำหนดเงื่อนไขซ้อนกัน (Nested Decision)
''' เป็นการนำ if...eles,if.elif มาซ้อนกันเพื่อสร้างเลือกที่ซับซ้อนลงได้มากขึ้นมีรูปแบบนั้นนี้'''

''' เงื่อนไขซ้อนในคำสั่ง if
if เงื่อนไข:  
    if เงื่อนไขต่อไป :
        คำสั่งStatement
    if-elif/else เงื่อนไขรองลงมา :
        คำสั่ง Statement
'''

''' เงื่อนไขซ้อนในคำสั่ง elif
elif เงื่อนไข:  
    if เงื่อนไขต่อไป :
        คำสั่งStatement
    if-elif/else เงื่อนไขรองลงมา :
        คำสั่ง Statement
'''

''' เงื่อนไขซ้อนในคำสั่ง else
else เงื่อนไข:  
    if เงื่อนไขต่อไป :
        คำสั่งStatement
    if-elif/else เงื่อนไขรองลงมา :
        คำสั่ง Statement
'''

n=int(input('Please enter integer number :')) #รับค่าตัวเลขมา
if n > 0 : #ถ้า n มากว่า 0 จะทำเงื่อนไขต่อไป
    if n%2 == 0: #ถ้า n ไม่มีเศษก็จะหยุด
        print('Positive even number')
    else : #ถ้าไม่ใช้ จะหยุดที่คำสั่งนี้
        print('Positive odd number')
elif n == 0 : #ถ้า n เท่ากับ 0 ก็จะทำคำสั่งนี้ 
    print('zero number')
else : #ถ้าไม่ตรงเลย จะหยุดที่ตรงคำสั่งนี้
    print('Negative number')