#ฟังก์ชัน Function
'''เป็นกลุ่มหรือบล็อกคำสั่งที่หน้าที่มีหน้าที่สำหรับทำงานอย่างใดอย่างหนึ่ง
สามารถแบ่งส่วนการทำงานของโปรแกรมภาษาอื่น ๆ อาจเรียกด้วยชื่อ โปรแกรมย่อย(Sub-routine)
โพรซีเยอร์(Procedure) หรือ เมธอด(Method)'''

#ประเภทของฟังก์ชัน
'''มี 2 ประเภท
    ฟังก์ชันจากไลบรารีมาตรฐาน (Standard Library)เป็นฟังก์ชันที่ผู้พัฒนานั้นสร้างขึ้น ถูกแบ่งเป็น 2 ส่วน คือ
        ฟังก์ชันในอินเตอร์พรีเตอร์ (Built in Functions) เป็นฟังก์ชันที่ถูกเก็ยอยู่ใรตัวแปลภาษา สามารถเรียกใข้ในโปรแกรมได้โดยไม่ต้องอ้างอิงที่มา ให้เรียกชื่อฟังก์ชันที่ต้องการใข้โดยตรง
        ฟังก์ชันจากโมดูลในไลบรารี(Library Functions) เป็นฟังก์ชันที่สร้างโดยทีมพัฒนาโปรแกรมแล้วจัดเก็บในสคริปต์หรือนิยามของฟังก์ชันเอาไว้ในไฟล์ (เรียกว่า โมดูล) ที่อยู่ในไลบรารี ก่อนจะนำมาใช้
        งานต้อง import โมดูลเข้ามาก่อนหลังจากนั้นให้อ้างถึงโมดูลและเรียกชื่อฟังก์ชันภายใต้ที่ต้องการใข้งาน
    ฟังก์ชัน
    ฟังก์ชันที่ผู้เขียนโปรแกรมสร้างขึ้นเอง (User defined function) เพื่อนำมาใข้พัฒนาโปรแกรม สามารถเก็บไลบรารีเผยแพร่ให้กับนักพัฒนาคนอื่น ๆ นำไปใช้ได้ ซึ้งปกติจะนิยามฟังก์ชันที่สร้างชึ้นเองก่อน
    จากนั้นจึงเรียกใข้ฟังก์ขันที่สร้้างขึ้นนี้ในตำแหน่งถัดมาได้
'''
#โครงสร้างFunction 
# def ชื่อฟังก์ชั้น() :
    # statement

def sayhi():
    print('Hello')

sayhi()
#ฟังก์ชันในไลบรารีมาตฐาน
'''ฟังก์ชันในไลบรารีมาตฐาน(Standtd Library)สำหรับภาษาไฟธอนแบ่งย่อยได้ 2 ประเภท คือ 
ฟังก์ชันในอินเตอร์พรีเตอร์ และฟังก์ชันในโมดูลของไลบรารี'''
# ฟังก์ชันในอินเตอร์พรีเตอร์(Built-in Function)
'''เป็นฟังก์ชันที่มีอยู่ในตัวแปลภาษาของเครื่องพัฒนา จึงสามารถเรียกใช้ในโปรแกรมได้โดยไม่ต้องอ้างอิงที่มา
เพราะเมื่อรันโปรแกรมอินเตอร์พรีเตอร์จะนำโค้คในบล็อกของฟังก์ชันนั้นมาแปลภาษาได้อย่างถูกต้อง เช่น print() type() และ range()
ไพธอนจะมี 69 ฟังก์ชันได้ ดูได้ในรูปฟังก์ชัน Built-in Function สำหรับฟังก์ชันพื้นฐานที่เราคุ้นเคยและมักจะนำไปใช้ในการเขียนโปรแกรม เช่น'''

'''
asd(x)หาค่าสมบรูณ์ของตัวเลข
chr(x)แปลงตัวเลขเป็นตัวอักษรแบบ Unicode
float(x)แปลงเลขจำนวนเต็มหรืออักขระเป็นตัวเลขทศนิยม
len(x)หาจำนวนตัวอักขระในข้อความ
input() รับข้อมูลจากภายนอกด้วยแป้นพิมพ์
int(x) แปลงตัวเลขและตัวอักษรเป็นเลขจำนวนเต็ม
pow(x,y)ยกกำลัง x ด้วย y
print(x) แสดงข้อความออกหน้าจอ
range(x)สร้องข้อมูล
str(x)แปลงตัวเลขเป็นตัวอักษร
type(x) ตรวจสอบและชนิดข้อมูลในตัวแปรและค่าคงที่
'''

# การใช้Built-in Function
print(chr(65)) #แปลงเลขเป็นตัวอักษร
s='python programming'
print(len(s)) #นับจำนวนตัวอักษร

#ฟังก์ชันจากโมดูลในไลบรารี
'''นอกBuilt-in Functioncแล้วทีมพัฒนาภาษาไพธอนได้สร้างฟังก์ชันสำหรับใช้ในการเขียนโปรแกรมเฉพาะทางในด้านต่าง ๆ เช่น ทางคณิตศาสตร์ สถิติ กราฟิก เป็ยต้น
การเรียกใช้ จะต้องประกาศในโปรแกรมด้วยคำสั่ง import หรือ from เพื่อให้อินเตอร์พรีเตอร์สามารถนำโค้คของฟังก์มาแปลภาษาได้อย่างถูกต้อง'''
