# การใช้ if __name__=='__main__' ในโมดูลฟังก์ชัน
from mymath import * #เรียกใช้ฟังก์ชัน mymayh
print('10 + 8 =',add(10,8))
'''
OUTPUT
Test 7 + 5 = 12 คำสั่งพิมพ์จะติดมาด้วย
10 + 8 = 18
'''

'''
 if __name__=='__main__' เป็นการบล็อกคำสั่งของโปรแกรมหลักก
 python จะมีตัวแปร __name__ ที่ใช้เก็บข้อมูล กรณีที่ทำงานอยู่ภายใน
 โมดูลของตัวเองก็จะเก็บค่าเป็น __main__ แต่กรณีที่ impotr ทำงานกับโค้คในโมดูลอื่น
 ตัวแปร __name__ ก็จะเก็บค่าเป็นชื่อของโมดูลนั้นแทน
'''
'''
เมื่อรันโมดูล ifname==main จะมีการ import mymath ซึ่งอินเตอร์พรีเตอร์จะไปประมวลผลฟังก์ชัน add()
ในฟังก์ชัน add() ในโมดูล mymath ไว้ใช้งาน จากนั้นในบล็อกของ if ตรวจสอบตัวแปร __name__ พบว่า
ทำงานอยู่ในโมดูลอื่นมีค่าเท่ากับ mymath เงื่อนไขไม่เป็นจริง จึงกลับออกมาที่โมดูล ifname==main และ print
แสดงผลลัพธ์จากการเรียกใช้ add()
'''
"""
โดยทั่วไปโมดูลที่ทำหน้าที่เก็บฟังก์ชัน (และคลาส) ไว้สำหรับแชร์ให้กับโมดูลอื่น ๆ จะไม่นิยม
เขียนคำสั่งการทำงานอย่างอื่นปะปนรวมอยู่ด้วย แต่กรณีที่เราสร้างฟังก์ชันให้ทำงานร่วมกับโปรแกรมหลักอยู่ในโมดูลเดียวกัน
และต้องการให้ฟังก์ชันเหล่านี้ถูก import นำไปใช้ในโมดูลอื่นได้อย่างไม่มีปัญหา โดยให้เราสร้าง if__name__=='__main__'
ไว้เป็นส่วนการทำงานของโปรแกรมหลัก เพื่อไม่ให้คำสั่งในบล็อกที่ถูกรันเมื่อมีการ import ไปใช้งานอยู่ในโมดูลอื่น ซึ่งจะสามารถเรียกใช้ได้เฉพาะฟังก์ชันนั้นเอง
"""