# การใช้ if __name__=='__main__' ในโมดูลฟังก์ชัน
def add(x,y):
    return x+y
if __name__=='__main__':
    print('Test 7 + 5 =',add(7,5))
    print('sanuadfsdfjk')
'''
เมื่อรันโมดูล mymath บล็อกคำสั่งของ if จะตรวจสอบตัวแปร __name__ พบว่าทำงานอยู่ภายในโมดูลจึงมีค่าเท่ากับ '__main__'
ืทำให้เงื่อนไขเป็นจริง จากนั้นจะทำการ    
print('Test 7 + 5 =',add(7,5))
print('sanuadfsdfjk')
'''
'''
 if __name__=='__main__' เป็นการบล็อกคำสั่งของโปรแกรมหลักก
 python จะมีตัวแปร __name__ ที่ใช้เก็บข้อมูล กรณีที่ทำงานอยู่ภายใน
 โมดูลของตัวเองก็จะเก็บค่าเป็น __main__ แต่กรณีที่ impotr ทำงานกับโค้คในโมดูลอื่น
 ตัวแปร __name__ ก็จะเก็บค่าเป็นชื่อของโมดูลนั้นแทน
'''
'''
เมื่อรันโมดูล ifname==main จะมีการ import mymath ซึ่งอินเตอร์พรีเตอร์จะไปประมวลผลฟังก์ชัน add()
ในฟังก์ชัน add() ในโมดูล mymath ไว้ใช้งาน จากนั้นในบล็อกของ if ตรวจสอบตัวแปร __name__ พบว่า
ทำงานอยู่ในโมดูลอื่นมีค่าเท่ากับ mymath เงื่อนไขไม่เป็นจริง จึงกลับออกมาที่โมดูล ifname==main และ print
แสดงผลลัพธ์จากการเรียกใช้ add()
'''